#设置客户端连接服务器端的编码
set names utf8;
#丢弃数据库，如果存在
drop database if exists dj_pro;
#创建新的数据库，设置存储字符的编码
create database dj_pro charset=utf8;
#进入数据库
use dj_pro;
#创建分类表
#云台列表
create table Cloud(
  cid int primary key auto_increment,
  structure varchar(200) ,  #结构
  run varchar(100),      #可控转动范围
  stable varchar(30),  #稳定系统
  speed varchar(30),  #速度
  deg varchar(30) #角度
  
);
insert into Cloud values
(1,
'俯仰：-135° 至 80°,横滚：-135° 至 45°,平移：-30° 至 30°',
'俯仰：-90° 至 60°,横滚：-90° 或 0°',
'3 轴机械增稳云台（俯仰、横滚、平移）',
'100°/s',
'±0.01°'
),
(null,
'俯仰：-135° 至 100°,横滚：-45° 至 45°,平移：-27° 至 27°',
'俯仰：-90° 至35°,横滚：-5° 或5°',
'3 轴机械增稳云台（俯仰、横滚、平移）',
'100°/s',
'±0.07°'
),
(null,
'俯仰：-110° 至 35°,横滚：-35° 至 35°,平移：-20° 至 20°',
'俯仰：-90° 至0°,-90° 至 20°（扩展）',
'3 轴机械增稳云台（俯仰、横滚、偏航）',
'100°/s',
'±0.01°'
),
(null,
'俯仰：-90° 至 0°（默认设置）,-90° 至 20°（扩展）,偏航：-30° 至 30°',
'俯仰：-90° 至 30°,横滚：-5° 或5°0° 或 90°（横拍及竖拍模式）',
'3 轴机械增稳云台（俯仰、横滚、平移）',
'120°/s',
'±0.02°'
),
(null,
'俯仰：-90° 至 30°,偏航：-30° 至 30°, ',
'俯仰：,-90° 至 30°',
'3 轴机械增稳云台（俯仰、横滚、平移）',
'120°/s',
'±0.02°'
),
(null,
'俯仰：-80° 至 0,偏航：-17° 至 17°, ',
'俯仰：,-85° 至 0°',
'2 轴机械增稳云台（俯仰、横滚）',
'120°/s',
'±0.03°'
);



#新建表格相机

create table Camera(
  caid int primary key auto_increment,
  sensor varchar(200) ,  #影响传感器
  lens varchar(100),      #镜头
  los varchar(100),  #ISO 范围
  speed varchar(30),  #快门速度
  maxsize varchar(100) ,#角度
  photo_mode  varchar(300), #照片拍摄模式
  resolution  varchar(500),   #录像分辨率
  video_rate  varchar(20), #视频最大码率
  fill varchar(50), #文件系统
  img varchar(50), #图片格式
  video_format varchar(50) #视频格式
);

insert into Camera values
(1,

'1/2.3 英寸 CMOS,有效像素：1200 万',

'视角：83°,等效焦距：24 mm,光圈：f/2.8,对焦点：1 m 至无穷远',

'视频：,100 至 3200（自动）,100 至 3200（手动）,照片：,100 至 3200（自动）,100 至 3200（手动）',

'电子快门：4 至 1/8000 s',

'4:3 宽高比：4000×3000,16:9 宽高比：4000×2250',

'单张拍摄：1200 万像素,多张连拍：不支持,自动包围曝光（AEB）：1200 万像素,3 张 @0.7EV 步长,定时拍摄：1200 万像素,JEPG：2/3/5/7/10/15/20/30/60 秒,RAW：5/7/10/15/20/30/60 秒,智能拍摄：不支持,竖拍全景：不支持,广角全景（3x3）：4819x3739,180° 全景（1x7）：7069x1352,球形全景（3×8+1）：4096x2048,（180° 和广角照片尺寸会根据不同的拍摄情况会有轻微变动）',

'4K: 3840×2160,24/25/30fps,2.7K: 2720×1530,24/25/30/48/50/60fps,FHD: 1920×1080,24/25/30/48/50/60fps',

'100 Mbps',

'FAT32 (≤ 32 GB),exFAT (> 32 GB)',

'JPEG / DNG (RAW)',

'MP4 (H.264/MPEG-4 AVC)'

),
(null,

'1 英寸 CMOS,
有效像素：2000 万',

'视角：84°,
等效焦距：24 mm,
光圈：f/2.8 - f/11,
对焦点：1 m 至无穷远（带自动对焦）',

'视频：,
100 至 3200（自动）,
100 至 6400（手动）,

照片：,
100 至 3200（自动）,
100 至 12800（手动）',

'电子快门：8 至 1/8000 s,
机械快门：8 至 1/2000 s',

'5472×3648',

'单张拍摄：2000 万像素,
多张连拍：2000 万像素，3/5/7/10/14 张,
自动包围曝光（AEB）：2000 万像素，3/5 张 @0.7EV 步长,
定时拍摄：2000 万像素（间隔：2/3/5/7/10/15/20/30/60 秒）,
智能拍摄：不支持,
竖拍全景（3×1）：不支持,
广角全景（3×3）：不支持,
180°全景（3×7）：不支持,
球形全景（3×8+1）：不支持',

'H.265,

C4K: 4096×2160,
24/25/30fps,
@100 Mbps,

4K: 3840×2160,
24/25/30fps,
@100 Mbps,

2.7K: 2720×1530,
24/25/30fps,
@65 Mbps,

2.7K: 2720×1530,
48/50/60fps,
@80 Mbps,

FHD: 1920×1080,
24/25/30fps,
@50 Mbps,

FHD: 1920×1080,
48/50/60fps,
@65 Mbps,

FHD: 1920×1080,
120fps,
@100 Mbps,

HD: 1280×720,
24/25/30fps,
@25 Mbps,

HD: 1280×720,
48/50/60fps,
@35 Mbps,

HD: 1280×720,
120fps,
@60 Mbps,

H.264,

C4K: 4096×2160,
24/25/30/48/50/60fps,
@100 Mbps,

4K: 3840×2160,
24/25/30/48/50/60fps,
@100 Mbps,

2.7K: 2720×1530,
24/25/30fps,
@80 Mbps,

2.7K: 2720×1530,
48/50/60fps,
@100 Mbps,

FHD: 1920×1080,
24/25/30fps,
@60 Mbps,

FHD: 1920×1080,
48/50/60fps,
@80 Mbps,

FHD: 1920×1080,
120fps,
@100 Mbps,

HD: 1280×720,
24/25/30fps,
@30 Mbps,

HD: 1280×720,
48/50/60fps,
@45 Mbps,

HD: 1280×720,
120fps,
@80 Mbps',

'100 Mbps',

'FAT32 (≤ 32 GB),

exFAT (> 32 GB)',

'JPEG / DNG (RAW)',

'MP4 / MOV (H.264/AVC, H.265/HEVC）'

),
(null,

'1/2.3 英寸 CMOS,有效像素：1200 万',

'视角：81.9°,
等效焦距：25 mm,
光圈：f/2.6,
对焦点：2 m 至无穷远',

'视频：,
100 至 3200（自动）,
100 至 3200（手动）,

照片：,
100 至 1600（自动）,
100 至 1600（手动）',

'电子快门：4 至 1/8000 s',

'3968×2976',

'单张拍摄：1200 万像素,
多张连拍：1200 万像素，3 张,
自动包围曝光（AEB）：1200 万像素，3 张 @0.7EV 步长,
定时拍摄：1200 万像素（间隔：2/3/5/7/10/15/20/30/60 秒）,
智能拍摄：不支持,
竖拍全景（3×1）：支持,
广角全景（3×3）：支持,
180° 全景（3×7）：支持,
球形全景（3×8+1）：不支持',

'1920×1080,
30fps',

'24 Mbps',

'FAT32',

'JPEG',

'MP4 (H.264/MPEG-4 AVC)'

),
(null,

'1 英寸 CMOS,
有效像素：2000 万',

'视角：77 °,
等效焦距：28 mm,
光圈：f/2.8 - f/11,
对焦点：1 m 至无穷远（带自动对焦）',

'视频：,
100 至 6400,

照片：,
100 至 3200（自动）,
100 至 12800（手动）',

'电子快门：8 至 1/8000 s',

'5427×3648',

'单张拍摄：2000 万像素,
多张连拍：2000 万像素,
自动包围曝光（AEB）：2000 万像素，3/5 张 @0.7EV 步长,
定时拍摄：2000 万像素,
JPEG：2/3/5/7/10/15/20/30/60 秒,
RAW：5/7/10/15/20/30/60 秒,
智能拍摄：不支持,
竖拍全景（3×1）：3328×8000,
广角全景（3×3）：8000×6144,
180° 全景（3×7）：8192×3500,
球形全景（3×8+1）：8192×4096',

'4K: 3840×2160,
24/25/30fps,

2.7K: 2688x1512,
24/25/30/48/50/60fps,

FHD: 1920×1080,
24/25/30/48/50/60/120fps',

'100 Mbps',

'FAT32 (≤ 32 GB),

exFAT (> 32 GB)',

'JPEG / DNG (RAW)',

'MP4 / MOV (H.264/MPEG-4 AVC, H.265/HEVC)'

),
(null,

'1/2.3 英寸 CMOS,
有效像素：1200 万',

'视角：83°,
等效焦距：24 mm,
光圈：f/2.8,
对焦点：1 m 至无穷远',

'视频：,
100 至 3200（自动）,
100 至 3200（手动）,

照片：,
100 至 1600（自动）,
100 至 3200（手动）,

照片：,
100 至 1600（自动）,
100 至 1600（手动）',

'电子快门：4 至 1/8000 s',

'4:3 宽高比：4000×3000,
16:9 宽高比：4000×2250',

'单张拍摄：1200 万像素,
多张连拍：不支持,
自动包围曝光 (AEB)：不支持,
定时拍摄：1200 万像素,
JEPG：2/3/5/7/10/15/20/30/60 秒,
智能拍摄：不支持,
竖拍全景：不支持,
广角全景：不支持,
180° 全景：不支持,
球形全景：不支持',

'2.7K: 2720x1530,
25/30fps,

FHD: 1920×1080,
25/30/50/60fps',

'40 Mbps',

'FAT32 (≤ 32 GB),

exFAT (> 32 GB)',

'JPEG',

'MP4 (H.264/MPEG-4 AVC)'

),
(null,

'1/2.3 英寸 CMOS,
有效像素：1235 万',

'视角：78.8°,
等效焦距：26 mm,
光圈：f/2.2,
对焦点：0.5 m 至无穷远（带自动对焦）',

'视频：,
100 至 3200（自动）,
100 至 3200（手动）,

照片：,
100 至 1600（自动）,
100 至 1600（手动）',

'电子快门：8 至 1/8000 s',

'4000×3000',

'单张拍摄：1200 万像素,
多张连拍：1200 万像素，3/5/7 张,
自动包围曝光（AEB）：1200 万像素，3 张 @0.7EV 步长,
定时拍摄：1200 万像素（间隔：2/3/5/7/10/15/20/30/60 秒）,
智能拍摄：不支持,
竖拍全景（3×1）：不支持,
广角全景（3×3）：不支持,
180° 全景（3×7）：不支持,
球形全景（3×8+1）：不支持',

'C4K: 4096×2160,
24fps,

4K: 3840×2160,
24/25/30fps,

2.7K: 2720x1530,
24/25/30fps,

FHD: 1920×1080,
24/25/30/48/50/60/96fps,

HD: 1280×720,
24/25/30/48/50/60/120fps',

'60 Mbps',

'FAT32 (≤ 32 GB),

exFAT (> 32 GB)',

'JPEG / DNG (RAW)',

'MP4 / MOV (H.264/MPEG-4 AVC)'

);

#智能飞行电池列表
create table Battery(
  bid int primary key auto_increment,
  energy varchar(200) ,  #能量
  volume varchar(100),      #容量
  voltage varchar(100),  #电压
  limit_voltage varchar(30),  #充电限制电压
  battery_type varchar(50),  #电池类型
  weight  varchar(100) ,#重量
  temperature  varchar(300), #充电环境温度
  max_power  varchar(500)  #最大充电功率
  
);
insert into Battery values
(1,

'59.29 Wh',

'3850 mAh',

'15.4 V',

'17.6 V',

'LiPo 4S',

'297 g',

'5℃ 至 40℃',

'80 W'

),
(null,

'17.28 Wh',

'2400 mAh',

'7.2 V',

'8.4 V',

'Li-ion 2S',

'100 g',

'5℃ 至 40℃',

'24 W'

),
(null,

'43.6 Wh',

'
3830 mAh',

'11.4 V',

'
13.05 V',

'LiPo 3S',

'240 g',

'5℃ 至 40℃',

'100 W'

),
(null,

'能量59.29 Wh',

'3850 mAh',

'15.4 V',

'17.6 V',

'LiPo 4S',

'297 g',

'5℃ 至 40℃',

'80 W'

),
(null,

'17.32 Wh',

'2250 mAh',

'7.7 V',

'8.8 V',

'LiPo 2S',

'82.5 g',

'5℃ 至 40℃',
'29 W'

),
(null,

'16.87 Wh',

'1480 mAh',

'1480 mAh',

'13.05 V',

'LiPo 3S',

'29 W',

'5℃ 至 40℃',
'29 W'
);


